NordicSemiconductor/nrfx/mdk/nrf54h20_enga_application_peripherals.h
/*

Copyright (c) 2010 - 2023, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGA_APPLICATION_PERIPHERALS_H
#define NRF54H20_ENGA_APPLICATION_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*User information configuration registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

/*Board information configuration registers*/
#define BICR_PRESENT 1
#define BICR_COUNT 1

#define BICR_P0_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P1_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P2_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P3_EXISTS 0                             /*!< (unspecified)                                                        */
#define BICR_P4_EXISTS 0                             /*!< (unspecified)                                                        */
#define BICR_P5_EXISTS 0                             /*!< (unspecified)                                                        */
#define BICR_P6_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P7_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P8_EXISTS 0                             /*!< (unspecified)                                                        */
#define BICR_P9_EXISTS 1                             /*!< (unspecified)                                                        */
#define BICR_P10_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P11_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P12_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P13_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P14_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P15_EXISTS 0                            /*!< (unspecified)                                                        */
#define BICR_P0_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P1_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P2_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P3_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P4_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P5_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P6_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P7_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P8_3V 0                                 /*!< (unspecified)                                                        */
#define BICR_P9_3V 1                                 /*!< (unspecified)                                                        */
#define BICR_P10_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P11_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P12_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P13_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P14_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P15_3V 0                                /*!< (unspecified)                                                        */
#define BICR_P0_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P1_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P2_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P3_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P4_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P5_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P6_DRIVECTRL 1                          /*!< (unspecified)                                                        */
#define BICR_P7_DRIVECTRL 1                          /*!< (unspecified)                                                        */
#define BICR_P8_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P9_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P10_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P11_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P12_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P13_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P14_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P15_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_PMICLDO 0                               /*!< (unspecified)                                                        */

/*CACHEDATA*/
#define CACHEDATA_PRESENT 1
#define CACHEDATA_COUNT 2

/*CACHEINFO*/
#define CACHEINFO_PRESENT 1
#define CACHEINFO_COUNT 2

/*Embedded Trace Macrocell*/
#define ETM_PRESENT 1
#define ETM_COUNT 1

/*Cross-Trigger Interface control*/
#define CTI_PRESENT 1
#define CTI_COUNT 3

